

/*
  This program and the accompanying materials are
  made available under the terms of the Eclipse Public License v2.0 which accompanies
  this distribution, and is available at https://www.eclipse.org/legal/epl-v20.html
  
  SPDX-License-Identifier: EPL-2.0
  
  Copyright Contributors to the Zowe Project.
*/

#ifdef METTLE
#pragma options(inline(noauto,noreport,,),optimize(3))
#endif

#ifdef METTLE
#include <metal/metal.h>
#include <metal/stddef.h>
#include <metal/stdio.h>
#include <metal/string.h>
#include <metal/stdlib.h>
#include "zowetypes.h"
#include "metalio.h"

#else
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "zowetypes.h"

#ifdef __ZOWE_OS_WINDOWS
#include <windows.h>
#endif /* windows case */

#endif

#include "alloc.h"
#include "utils.h"
#include "openprims.h"
#include "collections.h"

fixedBlockMgr *fbMgrCreate(int blockSize, int blocksPerExtend,
                           void *owner){
  fixedBlockMgr *mgr = (fixedBlockMgr*)safeMalloc(sizeof(fixedBlockMgr),"FixedBlockManager");

  mgr->owner = owner;
  /* intf("fbMgrCreateCalled bSize %d owner %x\n",
          blockSize,mgr->owner); */
  mgr->allExtents = NULL;
  mgr->freeList = NULL;
  mgr->currentBlock = NULL;
  mgr->blockSize = blockSize;
  mgr->blocksPerExtend = blocksPerExtend;
  mgr->blocksRemaining = 0;
  return mgr;
}

#define FB_HEADER_LENGTH 8

/* Needs external Monitor/Synchronization */
void *fbMgrAlloc(fixedBlockMgr *mgr){
  void *result = NULL;

  if (mgr == NULL){

    return decached;
  } else if (cache->size == 1){ /* count == size && size == 1 */

    LRUElement *recycledElement = cache->oldest;
    if (cache->trace){
      printf("recycle case (size=1) recycled = 0x%x\n",recycledElement);
    }
    void *decached = recycledElement->data;
    htRemove(ht,recycledElement->digest);
    memcpy(recycledElement->digest,digest,LRU_DIGEST_LENGTH);
    recycledElement->data = thing;
    htPut(ht,recycledElement->digest,recycledElement);
    return decached;

  } else{ /* count == size && size == 0 */
    if (cache->trace){
      printf("recycle case (size=0)\n");
    }
    return NULL;
  }
}


/* Thread Safe Queues

   (and on ZOS) Lock-Free Queues


   Windows *might* support lock-free queues:

   "Interlocked Singly Linked Lists"

   https://msdn.microsoft.com/en-us/library/windows/desktop/ms684121(v=vs.85).aspx

 */

#ifdef __ZOWE_OS_ZOS
/* The queue routines are written so that the will work in either AMODE
   31 or 64 using the same code.  To do this the code is dependent on the
   compiler defining pointers and "long" variables as 32 bits in AMODE 31
   and 64 bits in AMODE 64.  The __asm generated code is passed the size of
   one of a long variable and then uses conditional assembly statements to
   generate either 32 bit operand or 64 bit operand instructions and PLO
   operation codes based on the size of the long variable.  The offset of
   the fields in the queue header are also passed to the generated to use
   when loading and storing data into the queue header and elements,
   making the __asm code insensitive to the AMODE.

   Serialization of the queue is performed using either-

    - Constrained Transactional Execution
    - Perform-Locked-Operation (PLO)

   Flag PSATXC is tested to determine if the constrained Transactional
   Execution facility can be used or not.  If it can be, the counter in the
   queue header is set to -1 to indicate to the insert and remove routines
   to use it.  When incrementing the counter value in the PLO path the
   counter must never be allowed to overflow into the sign bit, making
   the value become negative.  Instead, the value must be wrapped back to
   1.
*/

#define PSATXC ((*(char*)0x240)&0x04)
#endif

Queue *makeQueue(int flags){
  Queue *q = (Queue*) safeMalloc(sizeof(Queue),"Queue");
  memset(q,0,sizeof(Queue));
  memcpy(q->eyecatcher,"LKFREQUE",8);
  q->flags = flags;
#ifdef __ZOWE_OS_ZOS
  if (PSATXC)
    q->counter = -1;         /* Indicate to use Transactional Execution */
  else
    q->counter = 1;          /* Start counter at 1                      */
#endif
  q->head = NULL;
  q->tail = NULL;
#ifdef __ZOWE_OS_WINDOWS
  q->mutex = CreateMutexEx(NULL,NULL,0x00000000,MUTEX_ALL_ACCESS);
#elif defined(__ZOWE_OS_LINUX) || defined(__ZOWE_OS_AIX)
  pthread_mutex_init(&(q->mutex),NULL); /* PTHREAD_MUTEX_INITIALIZER; */
#endif
  return q;
}

void destroyQueue(Queue *q) {
  safeFree((char*) q, sizeof(Queue));
}

#ifdef __ZOWE_OS_ZOS
ZOWE_PRAGMA_PACK

typedef struct CSTSTParms_tag{     /* PLO function 20/22 */
  long long filler00[7];           /* Offset 0x00 -   0  */
  PAD_LONG(x38,long thing1);       /* Offset 0x38 -  56  */
  int  fillerx40;                  /* Offset 0x40 -  64  */
  int  aletThing1;                 /* Offset 0x44 -  68  */
  PAD_LONG(x48,void* thing1Addr);  /* Offset 0x48 -  72  */
  long long filler50;              /* Offset 0x50 -  80  */
  PAD_LONG(x58,long thing2);       /* Offset 0x58 -  88  */
  int  fillerx60;                  /* Offset 0x60 -  96  */
  int  aletThing2;                 /* Offset 0x64 - 100  */
  PAD_LONG(x68,void* thing2Addr);  /* Offset 0x68 - 104  */
  long long fillerx70;             /* Offset 0x70 - 112  */
  PAD_LONG(x78,long thing3);       /* Offset 0x78 - 120  */
  int  fillerx80;                  /* Offset 0x80 - 128  */
  int  aletThing3;                 /* Offset 0x84 - 132  */
  PAD_LONG(x88,void* thing3Addr);  /* Offset 0x88 - 136  */
                                   /* Length 0x90 - 144  */
} CSTSTParms;

ZOWE_PRAGMA_PACK_RESET

#pragma inline(compareAndLoad)
static int compareAndLoad(long *oldCounter, long *counterAddress, long *sourceAddress, long *resultAddress){
  int status;
  __asm(ASM_PREFIX
        "&KGX(2)  SETC    'G'             Set 'G' for index #2\n"
        "&KF      SETA    %5/4            Set 'G'index value\n"
        "&KG      SETC    '&KGX(&KF)'     Set 'G' value\n"
        "&KL      SETC    'L&KG'          Set Load instruction\n"
        "&KST     SETC    'ST&KG'         Set Store instruction\n"
        "&KF      SETA    ((&KF-1)*2)     Set PLO function code\n"
        "&LX      SETA    &LX+1           Generate unique branch labels\n"
        "&L1      SETC    'TEXIT&LX'      \n"
        "         LA      1,0(,%2)        %2 - counterAddress\n"
